```diff
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/cookiecutter-django-tfdo-staging/runs/run-iJtihCnpAurJRAV8

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
data.digitalocean_ssh_key.ssh_key: Reading...
data.digitalocean_ssh_key.ssh_key: Read complete after 0s [name=martibosch-githubactions]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_spaces_bucket.bucket will be created
  + resource "digitalocean_spaces_bucket" "bucket" {
      + acl                = "public-read"
      + bucket_domain_name = (known after apply)
      + force_destroy      = true
      + id                 = (known after apply)
      + name               = "cookiecutter-django-tfdo-staging"
      + region             = "fra1"
      + urn                = (known after apply)

      + cors_rule {
          + allowed_methods = [
              + "GET",
            ]
          + allowed_origins = [
              + "staging.cookiecutter-django-tfdo.xyz.cookiecutter-django-tfdo.xyz",
            ]
        }
    }

  # module.droplet.digitalocean_domain.default[0] will be created
  + resource "digitalocean_domain" "default" {
      + id   = (known after apply)
      + name = "cookiecutter-django-tfdo.xyz"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.droplet.digitalocean_droplet.droplet will be created
  + resource "digitalocean_droplet" "droplet" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "cookiecutter-django-tfdo-staging"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "fra1"
      + resize_disk          = true
      + size                 = "s-2vcpu-4gb"
      + ssh_keys             = [
          + "34625765",
        ]
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # module.droplet.digitalocean_record.default["staging.cookiecutter-django-tfdo.xyz."] will be created
  + resource "digitalocean_record" "default" {
      + domain = "cookiecutter-django-tfdo.xyz"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "staging.cookiecutter-django-tfdo.xyz."
      + ttl    = 1800
      + type   = "A"
      + value  = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_address = (known after apply)
  + id             = (known after apply)
  + ipv4_address   = (known after apply)
  + name           = "cookiecutter-django-tfdo-staging"

```